{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "batch_input_shape": [null, 48, 48, 1], "strides": [1, 1], "kernel_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "name": "conv2d_37", "bias_constraint": null, "use_bias": true, "filters": 32, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_38", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "name": "batch_normalization_19", "scale": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_19", "pool_size": [3, 3], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_39", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_40", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "name": "batch_normalization_20", "scale": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_20", "pool_size": [3, 3], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_41", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_42", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "name": "batch_normalization_21", "scale": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_21", "pool_size": [3, 3], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "name": "dense_43", "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 1024, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_9", "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_constraint": null, "name": "dense_44", "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 8, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}